{"class_name": "Model", "keras_version": "2.3.1", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 4096, 1], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1d_1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1d_2"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_1"}, "inbound_nodes": [[["conv1d_1", 0, 0, {}], ["conv1d_2", 0, 0, {}]]], "name": "multiply_1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "name": "conv1d_3"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_1"}, "inbound_nodes": [[["input_1", 0, 0, {}], ["conv1d_3", 0, 0, {}]]], "name": "add_1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "conv1d_4"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "conv1d_5"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_2"}, "inbound_nodes": [[["conv1d_4", 0, 0, {}], ["conv1d_5", 0, 0, {}]]], "name": "multiply_2"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_2", 0, 0, {}]]], "name": "conv1d_6"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_2"}, "inbound_nodes": [[["add_1", 0, 0, {}], ["conv1d_6", 0, 0, {}]]], "name": "add_2"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_7", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "conv1d_7"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "conv1d_8"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_3"}, "inbound_nodes": [[["conv1d_7", 0, 0, {}], ["conv1d_8", 0, 0, {}]]], "name": "multiply_3"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_9", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_3", 0, 0, {}]]], "name": "conv1d_9"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_3"}, "inbound_nodes": [[["add_2", 0, 0, {}], ["conv1d_9", 0, 0, {}]]], "name": "add_3"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_10", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "conv1d_10"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_11", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "conv1d_11"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_4"}, "inbound_nodes": [[["conv1d_10", 0, 0, {}], ["conv1d_11", 0, 0, {}]]], "name": "multiply_4"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_12", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_4", 0, 0, {}]]], "name": "conv1d_12"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_4"}, "inbound_nodes": [[["add_3", 0, 0, {}], ["conv1d_12", 0, 0, {}]]], "name": "add_4"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_13", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "conv1d_13"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_14", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "conv1d_14"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_5"}, "inbound_nodes": [[["conv1d_13", 0, 0, {}], ["conv1d_14", 0, 0, {}]]], "name": "multiply_5"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_15", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_5", 0, 0, {}]]], "name": "conv1d_15"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_5"}, "inbound_nodes": [[["add_4", 0, 0, {}], ["conv1d_15", 0, 0, {}]]], "name": "add_5"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_16", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "conv1d_16"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_17", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "conv1d_17"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_6"}, "inbound_nodes": [[["conv1d_16", 0, 0, {}], ["conv1d_17", 0, 0, {}]]], "name": "multiply_6"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_18", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_6", 0, 0, {}]]], "name": "conv1d_18"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_6"}, "inbound_nodes": [[["add_5", 0, 0, {}], ["conv1d_18", 0, 0, {}]]], "name": "add_6"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_19", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "conv1d_19"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_20", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "conv1d_20"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_7"}, "inbound_nodes": [[["conv1d_19", 0, 0, {}], ["conv1d_20", 0, 0, {}]]], "name": "multiply_7"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_21", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_7", 0, 0, {}]]], "name": "conv1d_21"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_7"}, "inbound_nodes": [[["add_6", 0, 0, {}], ["conv1d_21", 0, 0, {}]]], "name": "add_7"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_22", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "conv1d_22"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_23", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "conv1d_23"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_8"}, "inbound_nodes": [[["conv1d_22", 0, 0, {}], ["conv1d_23", 0, 0, {}]]], "name": "multiply_8"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_24", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_8", 0, 0, {}]]], "name": "conv1d_24"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_8"}, "inbound_nodes": [[["add_7", 0, 0, {}], ["conv1d_24", 0, 0, {}]]], "name": "add_8"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_25", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "conv1d_25"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_26", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "conv1d_26"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_9"}, "inbound_nodes": [[["conv1d_25", 0, 0, {}], ["conv1d_26", 0, 0, {}]]], "name": "multiply_9"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_27", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_9", 0, 0, {}]]], "name": "conv1d_27"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_9"}, "inbound_nodes": [[["add_8", 0, 0, {}], ["conv1d_27", 0, 0, {}]]], "name": "add_9"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_28", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "conv1d_28"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_29", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "conv1d_29"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_10"}, "inbound_nodes": [[["conv1d_28", 0, 0, {}], ["conv1d_29", 0, 0, {}]]], "name": "multiply_10"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_30", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_10", 0, 0, {}]]], "name": "conv1d_30"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_10"}, "inbound_nodes": [[["add_9", 0, 0, {}], ["conv1d_30", 0, 0, {}]]], "name": "add_10"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_31", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_10", 0, 0, {}]]], "name": "conv1d_31"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_32", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_10", 0, 0, {}]]], "name": "conv1d_32"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_11"}, "inbound_nodes": [[["conv1d_31", 0, 0, {}], ["conv1d_32", 0, 0, {}]]], "name": "multiply_11"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_33", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_11", 0, 0, {}]]], "name": "conv1d_33"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_11"}, "inbound_nodes": [[["add_10", 0, 0, {}], ["conv1d_33", 0, 0, {}]]], "name": "add_11"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_34", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_11", 0, 0, {}]]], "name": "conv1d_34"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_35", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_11", 0, 0, {}]]], "name": "conv1d_35"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_12"}, "inbound_nodes": [[["conv1d_34", 0, 0, {}], ["conv1d_35", 0, 0, {}]]], "name": "multiply_12"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_36", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_12", 0, 0, {}]]], "name": "conv1d_36"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_12"}, "inbound_nodes": [[["add_11", 0, 0, {}], ["conv1d_36", 0, 0, {}]]], "name": "add_12"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_37", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_12", 0, 0, {}]]], "name": "conv1d_37"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_38", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_12", 0, 0, {}]]], "name": "conv1d_38"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_13"}, "inbound_nodes": [[["conv1d_37", 0, 0, {}], ["conv1d_38", 0, 0, {}]]], "name": "multiply_13"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_39", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_13", 0, 0, {}]]], "name": "conv1d_39"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_13"}, "inbound_nodes": [[["add_12", 0, 0, {}], ["conv1d_39", 0, 0, {}]]], "name": "add_13"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_40", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_13", 0, 0, {}]]], "name": "conv1d_40"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_41", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_13", 0, 0, {}]]], "name": "conv1d_41"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_14"}, "inbound_nodes": [[["conv1d_40", 0, 0, {}], ["conv1d_41", 0, 0, {}]]], "name": "multiply_14"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_42", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_14", 0, 0, {}]]], "name": "conv1d_42"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_14"}, "inbound_nodes": [[["add_13", 0, 0, {}], ["conv1d_42", 0, 0, {}]]], "name": "add_14"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_43", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_14", 0, 0, {}]]], "name": "conv1d_43"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_44", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_14", 0, 0, {}]]], "name": "conv1d_44"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_15"}, "inbound_nodes": [[["conv1d_43", 0, 0, {}], ["conv1d_44", 0, 0, {}]]], "name": "multiply_15"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_45", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_15", 0, 0, {}]]], "name": "conv1d_45"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_15"}, "inbound_nodes": [[["add_14", 0, 0, {}], ["conv1d_45", 0, 0, {}]]], "name": "add_15"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_46", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_15", 0, 0, {}]]], "name": "conv1d_46"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_47", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_15", 0, 0, {}]]], "name": "conv1d_47"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_16"}, "inbound_nodes": [[["conv1d_46", 0, 0, {}], ["conv1d_47", 0, 0, {}]]], "name": "multiply_16"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_48", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_16", 0, 0, {}]]], "name": "conv1d_48"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_16"}, "inbound_nodes": [[["add_15", 0, 0, {}], ["conv1d_48", 0, 0, {}]]], "name": "add_16"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_49", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_16", 0, 0, {}]]], "name": "conv1d_49"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_50", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_16", 0, 0, {}]]], "name": "conv1d_50"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_17"}, "inbound_nodes": [[["conv1d_49", 0, 0, {}], ["conv1d_50", 0, 0, {}]]], "name": "multiply_17"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_51", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_17", 0, 0, {}]]], "name": "conv1d_51"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_17"}, "inbound_nodes": [[["add_16", 0, 0, {}], ["conv1d_51", 0, 0, {}]]], "name": "add_17"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_52", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_17", 0, 0, {}]]], "name": "conv1d_52"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_53", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_17", 0, 0, {}]]], "name": "conv1d_53"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_18"}, "inbound_nodes": [[["conv1d_52", 0, 0, {}], ["conv1d_53", 0, 0, {}]]], "name": "multiply_18"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_54", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_18", 0, 0, {}]]], "name": "conv1d_54"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_18"}, "inbound_nodes": [[["add_17", 0, 0, {}], ["conv1d_54", 0, 0, {}]]], "name": "add_18"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_55", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_18", 0, 0, {}]]], "name": "conv1d_55"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_56", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_18", 0, 0, {}]]], "name": "conv1d_56"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_19"}, "inbound_nodes": [[["conv1d_55", 0, 0, {}], ["conv1d_56", 0, 0, {}]]], "name": "multiply_19"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_57", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_19", 0, 0, {}]]], "name": "conv1d_57"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_19"}, "inbound_nodes": [[["add_18", 0, 0, {}], ["conv1d_57", 0, 0, {}]]], "name": "add_19"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_58", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_19", 0, 0, {}]]], "name": "conv1d_58"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_59", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_19", 0, 0, {}]]], "name": "conv1d_59"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_20"}, "inbound_nodes": [[["conv1d_58", 0, 0, {}], ["conv1d_59", 0, 0, {}]]], "name": "multiply_20"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_60", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_20", 0, 0, {}]]], "name": "conv1d_60"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_20"}, "inbound_nodes": [[["add_19", 0, 0, {}], ["conv1d_60", 0, 0, {}]]], "name": "add_20"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_61", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_20", 0, 0, {}]]], "name": "conv1d_61"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_62", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_20", 0, 0, {}]]], "name": "conv1d_62"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_21"}, "inbound_nodes": [[["conv1d_61", 0, 0, {}], ["conv1d_62", 0, 0, {}]]], "name": "multiply_21"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_63", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 128, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["multiply_21", 0, 0, {}]]], "name": "conv1d_63"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_21"}, "inbound_nodes": 